MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27K40/mcu.h
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0xEB7);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 0EB7h");
#endif
// aliases
extern volatile unsigned char           SSPCLKPPS           __at(0xEB7);
#ifndef _LIB_BUILD
asm("SSPCLKPPS equ 0EB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPCLKPPS              :5;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0xEB7);
// bitfield macros
#define _SSP1CLKPPS_PIN_POSN                                0x0
#define _SSP1CLKPPS_PIN_POSITION                            0x0
#define _SSP1CLKPPS_PIN_SIZE                                0x3
#define _SSP1CLKPPS_PIN_LENGTH                              0x3
#define _SSP1CLKPPS_PIN_MASK                                0x7
#define _SSP1CLKPPS_PORT_POSN                               0x3
#define _SSP1CLKPPS_PORT_POSITION                           0x3
#define _SSP1CLKPPS_PORT_SIZE                               0x2
#define _SSP1CLKPPS_PORT_LENGTH                             0x2
#define _SSP1CLKPPS_PORT_MASK                               0x18
#define _SSP1CLKPPS_SSPCLKPPS_POSN                          0x0
#define _SSP1CLKPPS_SSPCLKPPS_POSITION                      0x0
#define _SSP1CLKPPS_SSPCLKPPS_SIZE                          0x5
#define _SSP1CLKPPS_SSPCLKPPS_LENGTH                        0x5
#define _SSP1CLKPPS_SSPCLKPPS_MASK                          0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPCLKPPS              :5;
    };
} SSPCLKPPSbits_t;
extern volatile SSPCLKPPSbits_t SSPCLKPPSbits __at(0xEB7);
// bitfield macros
#define _SSPCLKPPS_PIN_POSN                                 0x0
#define _SSPCLKPPS_PIN_POSITION                             0x0
#define _SSPCLKPPS_PIN_SIZE                                 0x3
#define _SSPCLKPPS_PIN_LENGTH                               0x3
#define _SSPCLKPPS_PIN_MASK                                 0x7
#define _SSPCLKPPS_PORT_POSN                                0x3
#define _SSPCLKPPS_PORT_POSITION                            0x3
#define _SSPCLKPPS_PORT_SIZE                                0x2
#define _SSPCLKPPS_PORT_LENGTH                              0x2
#define _SSPCLKPPS_PORT_MASK                                0x18
#define _SSPCLKPPS_SSPCLKPPS_POSN                           0x0
#define _SSPCLKPPS_SSPCLKPPS_POSITION                       0x0
#define _SSPCLKPPS_SSPCLKPPS_SIZE                           0x5
#define _SSPCLKPPS_SSPCLKPPS_LENGTH                         0x5
#define _SSPCLKPPS_SSPCLKPPS_MASK                           0x1F

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
extern volatile unsigned char           SSP1DATPPS          __at(0xEB8);
#ifndef _LIB_BUILD
asm("SSP1DATPPS equ 0EB8h");
#endif
// aliases
extern volatile unsigned char           SSPDATPPS           __at(0xEB8);
#ifndef _LIB_BUILD
asm("SSPDATPPS equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
} SSP1DATPPSbits_t;
extern volatile SSP1DATPPSbits_t SSP1DATPPSbits __at(0xEB8);
// bitfield macros
#define _SSP1DATPPS_PIN_POSN                                0x0
#define _SSP1DATPPS_PIN_POSITION                            0x0
#define _SSP1DATPPS_PIN_SIZE                                0x3
#define _SSP1DATPPS_PIN_LENGTH                              0x3
#define _SSP1DATPPS_PIN_MASK                                0x7
#define _SSP1DATPPS_PORT_POSN                               0x3
#define _SSP1DATPPS_PORT_POSITION                           0x3
#define _SSP1DATPPS_PORT_SIZE                               0x2
#define _SSP1DATPPS_PORT_LENGTH                             0x2
#define _SSP1DATPPS_PORT_MASK                               0x18
#define _SSP1DATPPS_SSPDATPPS_POSN                          0x0
#define _SSP1DATPPS_SSPDATPPS_POSITION                      0x0
#define _SSP1DATPPS_SSPDATPPS_SIZE                          0x5
#define _SSP1DATPPS_SSPDATPPS_LENGTH                        0x5
#define _SSP1DATPPS_SSPDATPPS_MASK                          0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
} SSPDATPPSbits_t;
extern volatile SSPDATPPSbits_t SSPDATPPSbits __at(0xEB8);
// bitfield macros
#define _SSPDATPPS_PIN_POSN                                 0x0
#define _SSPDATPPS_PIN_POSITION                             0x0
#define _SSPDATPPS_PIN_SIZE                                 0x3
#define _SSPDATPPS_PIN_LENGTH                               0x3
#define _SSPDATPPS_PIN_MASK                                 0x7
#define _SSPDATPPS_PORT_POSN                                0x3
#define _SSPDATPPS_PORT_POSITION                            0x3
#define _SSPDATPPS_PORT_SIZE                                0x2
#define _SSPDATPPS_PORT_LENGTH                              0x2
#define _SSPDATPPS_PORT_MASK                                0x18
#define _SSPDATPPS_SSPDATPPS_POSN                           0x0
#define _SSPDATPPS_SSPDATPPS_POSITION                       0x0
#define _SSPDATPPS_SSPDATPPS_SIZE                           0x5
#define _SSPDATPPS_SSPDATPPS_LENGTH                         0x5
#define _SSPDATPPS_SSPDATPPS_MASK                           0x1F

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
extern volatile unsigned char           SSP1SSPPS           __at(0xEB9);
#ifndef _LIB_BUILD
asm("SSP1SSPPS equ 0EB9h");
#endif
// aliases
extern volatile unsigned char           SSPSSPPS            __at(0xEB9);
#ifndef _LIB_BUILD
asm("SSPSSPPS equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
} SSP1SSPPSbits_t;
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0xEB9);
// bitfield macros
#define _SSP1SSPPS_PIN_POSN                                 0x0
#define _SSP1SSPPS_PIN_POSITION                             0x0
#define _SSP1SSPPS_PIN_SIZE                                 0x3
#define _SSP1SSPPS_PIN_LENGTH                               0x3
#define _SSP1SSPPS_PIN_MASK                                 0x7
#define _SSP1SSPPS_PORT_POSN                                0x3
#define _SSP1SSPPS_PORT_POSITION                            0x3
#define _SSP1SSPPS_PORT_SIZE                                0x2
#define _SSP1SSPPS_PORT_LENGTH                              0x2
#define _SSP1SSPPS_PORT_MASK                                0x18
#define _SSP1SSPPS_SSPSSPPS_POSN                            0x0
#define _SSP1SSPPS_SSPSSPPS_POSITION                        0x0
#define _SSP1SSPPS_SSPSSPPS_SIZE                            0x5
#define _SSP1SSPPS_SSPSSPPS_LENGTH                          0x5
#define _SSP1SSPPS_SSPSSPPS_MASK                            0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
} SSPSSPPSbits_t;
extern volatile SSPSSPPSbits_t SSPSSPPSbits __at(0xEB9);
// bitfield macros
#define _SSPSSPPS_PIN_POSN                                  0x0
#define _SSPSSPPS_PIN_POSITION                              0x0
#define _SSPSSPPS_PIN_SIZE                                  0x3
#define _SSPSSPPS_PIN_LENGTH                                0x3
#define _SSPSSPPS_PIN_MASK                                  0x7
#define _SSPSSPPS_PORT_POSN                                 0x3
#define _SSPSSPPS_PORT_POSITION                             0x3
#define _SSPSSPPS_PORT_SIZE                                 0x2
#define _SSPSSPPS_PORT_LENGTH                               0x2
#define _SSPSSPPS_PORT_MASK                                 0x18
#define _SSPSSPPS_SSPSSPPS_POSN                             0x0
#define _SSPSSPPS_SSPSSPPS_POSITION                         0x0
#define _SSPSSPPS_SSPSSPPS_SIZE                             0x5
#define _SSPSSPPS_SSPSSPPS_LENGTH                           0x5
#define _SSPSSPPS_SSPSSPPS_MASK                             0x1F

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0xEBA);
#ifndef _LIB_BUILD
asm("IPR0 equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned INT1IP                 :1;
        unsigned INT2IP                 :1;
        unsigned                        :1;
        unsigned IOCIP                  :1;
        unsigned TMR0IP                 :1;
    };
} IPR0bits_t;
extern volatile IPR0bits_t IPR0bits __at(0xEBA);
// bitfield macros
#define _IPR0_INT0IP_POSN                                   0x0
#define _IPR0_INT0IP_POSITION                               0x0
#define _IPR0_INT0IP_SIZE                                   0x1
#define _IPR0_INT0IP_LENGTH                                 0x1
#define _IPR0_INT0IP_MASK                                   0x1
#define _IPR0_INT1IP_POSN                                   0x1
#define _IPR0_INT1IP_POSITION                               0x1
#define _IPR0_INT1IP_SIZE                                   0x1
#define _IPR0_INT1IP_LENGTH                                 0x1
#define _IPR0_INT1IP_MASK                                   0x2
#define _IPR0_INT2IP_POSN                                   0x2
#define _IPR0_INT2IP_POSITION                               0x2
#define _IPR0_INT2IP_SIZE                                   0x1
#define _IPR0_INT2IP_LENGTH                                 0x1
#define _IPR0_INT2IP_MASK                                   0x4
#define _IPR0_IOCIP_POSN                                    0x4
#define _IPR0_IOCIP_POSITION                                0x4
#define _IPR0_IOCIP_SIZE                                    0x1
#define _IPR0_IOCIP_LENGTH                                  0x1
#define _IPR0_IOCIP_MASK                                    0x10
#define _IPR0_TMR0IP_POSN                                   0x5
#define _IPR0_TMR0IP_POSITION                               0x5
#define _IPR0_TMR0IP_SIZE                                   0x1
#define _IPR0_TMR0IP_LENGTH                                 0x1
#define _IPR0_TMR0IP_MASK                                   0x20

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0xEBB);
#ifndef _LIB_BUILD
asm("IPR1 equ 0EBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIP                   :1;
        unsigned ADTIP                  :1;
        unsigned                        :4;
        unsigned CSWIP                  :1;
        unsigned OSCFIP                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned PSPIP                  :1;
    };
} IPR1bits_t;
extern volatile IPR1bits_t IPR1bits __at(0xEBB);
// bitfield macros
#define _IPR1_ADIP_POSN                                     0x0
#define _IPR1_ADIP_POSITION                                 0x0
#define _IPR1_ADIP_SIZE                                     0x1
#define _IPR1_ADIP_LENGTH                                   0x1
#define _IPR1_ADIP_MASK                                     0x1
#define _IPR1_ADTIP_POSN                                    0x1
#define _IPR1_ADTIP_POSITION                                0x1
#define _IPR1_ADTIP_SIZE                                    0x1
#define _IPR1_ADTIP_LENGTH                                  0x1
#define _IPR1_ADTIP_MASK                                    0x2
#define _IPR1_CSWIP_POSN                                    0x6
#define _IPR1_CSWIP_POSITION                                0x6
#define _IPR1_CSWIP_SIZE                                    0x1
#define _IPR1_CSWIP_LENGTH                                  0x1
#define _IPR1_CSWIP_MASK                                    0x40
#define _IPR1_OSCFIP_POSN                                   0x7
#define _IPR1_OSCFIP_POSITION                               0x7
#define _IPR1_OSCFIP_SIZE                                   0x1
#define _IPR1_OSCFIP_LENGTH                                 0x1
#define _IPR1_OSCFIP_MASK                                   0x80
#define _IPR1_PSPIP_POSN                                    0x7
#define _IPR1_PSPIP_POSITION                                0x7
#define _IPR1_PSPIP_SIZE                                    0x1
#define _IPR1_PSPIP_LENGTH                                  0x1
#define _IPR1_PSPIP_MASK                                    0x80

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0xEBC);
#ifndef _LIB_BUILD
asm("IPR2 equ 0EBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IP                   :1;
        unsigned C2IP                   :1;
        unsigned                        :4;
        unsigned ZCDIP                  :1;
        unsigned HLVDIP                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIP                   :1;
    };
} IPR2bits_t;
extern volatile IPR2bits_t IPR2bits __at(0xEBC);
// bitfield macros
#define _IPR2_C1IP_POSN                                     0x0
#define _IPR2_C1IP_POSITION                                 0x0
#define _IPR2_C1IP_SIZE                                     0x1
#define _IPR2_C1IP_LENGTH                                   0x1
#define _IPR2_C1IP_MASK                                     0x1
#define _IPR2_C2IP_POSN                                     0x1
#define _IPR2_C2IP_POSITION                                 0x1
#define _IPR2_C2IP_SIZE                                     0x1
#define _IPR2_C2IP_LENGTH                                   0x1
#define _IPR2_C2IP_MASK                                     0x2
#define _IPR2_ZCDIP_POSN                                    0x6
#define _IPR2_ZCDIP_POSITION                                0x6
#define _IPR2_ZCDIP_SIZE                                    0x1
#define _IPR2_ZCDIP_LENGTH                                  0x1
#define _IPR2_ZCDIP_MASK                                    0x40
#define _IPR2_HLVDIP_POSN                                   0x7
#define _IPR2_HLVDIP_POSITION                               0x7
#define _IPR2_HLVDIP_SIZE                                   0x1
#define _IPR2_HLVDIP_LENGTH                                 0x1
#define _IPR2_HLVDIP_MASK                                   0x80
#define _IPR2_CMIP_POSN                                     0x6
#define _IPR2_CMIP_POSITION                                 0x6
#define _IPR2_CMIP_SIZE                                     0x1
#define _IPR2_CMIP_LENGTH                                   0x1
#define _IPR2_CMIP_MASK                                     0x40

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0xEBD);
#ifndef _LIB_BUILD
asm("IPR3 equ 0EBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1IP                 :1;
        unsigned BCL1IP                 :1;
        unsigned SSP2IP                 :1;
        unsigned BCL2IP                 :1;
        unsigned TX1IP                  :1;
        unsigned RC1IP                  :1;
        unsigned TX2IP                  :1;
        unsigned RC2IP                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIP                 :1;
        unsigned                        :2;
        unsigned TXBNIP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0xEBD);
// bitfield macros
#define _IPR3_SSP1IP_POSN                                   0x0
#define _IPR3_SSP1IP_POSITION                               0x0
#define _IPR3_SSP1IP_SIZE                                   0x1
#define _IPR3_SSP1IP_LENGTH                                 0x1
#define _IPR3_SSP1IP_MASK                                   0x1
#define _IPR3_BCL1IP_POSN                                   0x1
#define _IPR3_BCL1IP_POSITION                               0x1
#define _IPR3_BCL1IP_SIZE                                   0x1
#define _IPR3_BCL1IP_LENGTH                                 0x1
#define _IPR3_BCL1IP_MASK                                   0x2
#define _IPR3_SSP2IP_POSN                                   0x2
#define _IPR3_SSP2IP_POSITION                               0x2
#define _IPR3_SSP2IP_SIZE                                   0x1
#define _IPR3_SSP2IP_LENGTH                                 0x1
#define _IPR3_SSP2IP_MASK                                   0x4
#define _IPR3_BCL2IP_POSN                                   0x3
#define _IPR3_BCL2IP_POSITION                               0x3
#define _IPR3_BCL2IP_SIZE                                   0x1
#define _IPR3_BCL2IP_LENGTH                                 0x1
#define _IPR3_BCL2IP_MASK                                   0x8
#define _IPR3_TX1IP_POSN                                    0x4
#define _IPR3_TX1IP_POSITION                                0x4
#define _IPR3_TX1IP_SIZE                                    0x1
#define _IPR3_TX1IP_LENGTH                                  0x1
#define _IPR3_TX1IP_MASK                                    0x10
#define _IPR3_RC1IP_POSN                                    0x5
#define _IPR3_RC1IP_POSITION                                0x5
#define _IPR3_RC1IP_SIZE                                    0x1
#define _IPR3_RC1IP_LENGTH                                  0x1
#define _IPR3_RC1IP_MASK                                    0x20
#define _IPR3_TX2IP_POSN                                    0x6
#define _IPR3_TX2IP_POSITION                                0x6
#define _IPR3_TX2IP_SIZE                                    0x1
#define _IPR3_TX2IP_LENGTH                                  0x1
#define _IPR3_TX2IP_MASK                                    0x40
#define _IPR3_RC2IP_POSN                                    0x7
#define _IPR3_RC2IP_POSITION                                0x7
#define _IPR3_RC2IP_SIZE                                    0x1
#define _IPR3_RC2IP_LENGTH                                  0x1
#define _IPR3_RC2IP_MASK                                    0x80
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

