MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27K40/mcu.h
extern volatile T3CONbits_t T3CONbits __at(0xFC9);
// bitfield macros
#define _T3CON_NOT_SYNC_POSN                                0x2
#define _T3CON_NOT_SYNC_POSITION                            0x2
#define _T3CON_NOT_SYNC_SIZE                                0x1
#define _T3CON_NOT_SYNC_LENGTH                              0x1
#define _T3CON_NOT_SYNC_MASK                                0x4
#define _T3CON_ON_POSN                                      0x0
#define _T3CON_ON_POSITION                                  0x0
#define _T3CON_ON_SIZE                                      0x1
#define _T3CON_ON_LENGTH                                    0x1
#define _T3CON_ON_MASK                                      0x1
#define _T3CON_RD16_POSN                                    0x1
#define _T3CON_RD16_POSITION                                0x1
#define _T3CON_RD16_SIZE                                    0x1
#define _T3CON_RD16_LENGTH                                  0x1
#define _T3CON_RD16_MASK                                    0x2
#define _T3CON_nSYNC_POSN                                   0x2
#define _T3CON_nSYNC_POSITION                               0x2
#define _T3CON_nSYNC_SIZE                                   0x1
#define _T3CON_nSYNC_LENGTH                                 0x1
#define _T3CON_nSYNC_MASK                                   0x4
#define _T3CON_CKPS_POSN                                    0x4
#define _T3CON_CKPS_POSITION                                0x4
#define _T3CON_CKPS_SIZE                                    0x2
#define _T3CON_CKPS_LENGTH                                  0x2
#define _T3CON_CKPS_MASK                                    0x30
#define _T3CON_NOT_T3SYNC_POSN                              0x2
#define _T3CON_NOT_T3SYNC_POSITION                          0x2
#define _T3CON_NOT_T3SYNC_SIZE                              0x1
#define _T3CON_NOT_T3SYNC_LENGTH                            0x1
#define _T3CON_NOT_T3SYNC_MASK                              0x4
#define _T3CON_TMR3ON_POSN                                  0x0
#define _T3CON_TMR3ON_POSITION                              0x0
#define _T3CON_TMR3ON_SIZE                                  0x1
#define _T3CON_TMR3ON_LENGTH                                0x1
#define _T3CON_TMR3ON_MASK                                  0x1
#define _T3CON_T3RD16_POSN                                  0x1
#define _T3CON_T3RD16_POSITION                              0x1
#define _T3CON_T3RD16_SIZE                                  0x1
#define _T3CON_T3RD16_LENGTH                                0x1
#define _T3CON_T3RD16_MASK                                  0x2
#define _T3CON_nT3SYNC_POSN                                 0x2
#define _T3CON_nT3SYNC_POSITION                             0x2
#define _T3CON_nT3SYNC_SIZE                                 0x1
#define _T3CON_nT3SYNC_LENGTH                               0x1
#define _T3CON_nT3SYNC_MASK                                 0x4
#define _T3CON_T3CKPS0_POSN                                 0x4
#define _T3CON_T3CKPS0_POSITION                             0x4
#define _T3CON_T3CKPS0_SIZE                                 0x1
#define _T3CON_T3CKPS0_LENGTH                               0x1
#define _T3CON_T3CKPS0_MASK                                 0x10
#define _T3CON_T3CKPS1_POSN                                 0x5
#define _T3CON_T3CKPS1_POSITION                             0x5
#define _T3CON_T3CKPS1_SIZE                                 0x1
#define _T3CON_T3CKPS1_LENGTH                               0x1
#define _T3CON_T3CKPS1_MASK                                 0x20
#define _T3CON_CKPS0_POSN                                   0x4
#define _T3CON_CKPS0_POSITION                               0x4
#define _T3CON_CKPS0_SIZE                                   0x1
#define _T3CON_CKPS0_LENGTH                                 0x1
#define _T3CON_CKPS0_MASK                                   0x10
#define _T3CON_CKPS1_POSN                                   0x5
#define _T3CON_CKPS1_POSITION                               0x5
#define _T3CON_CKPS1_SIZE                                   0x1
#define _T3CON_CKPS1_LENGTH                                 0x1
#define _T3CON_CKPS1_MASK                                   0x20
#define _T3CON_RD163_POSN                                   0x1
#define _T3CON_RD163_POSITION                               0x1
#define _T3CON_RD163_SIZE                                   0x1
#define _T3CON_RD163_LENGTH                                 0x1
#define _T3CON_RD163_MASK                                   0x2

// Register: T3GCON
#define T3GCON T3GCON
extern volatile unsigned char           T3GCON              __at(0xFCA);
#ifndef _LIB_BUILD
asm("T3GCON equ 0FCAh");
#endif
// aliases
extern volatile unsigned char           PR3                 __at(0xFCA);
#ifndef _LIB_BUILD
asm("PR3 equ 0FCAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO_nDONE            :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned T3GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO                  :1;
    };
} T3GCONbits_t;
extern volatile T3GCONbits_t T3GCONbits __at(0xFCA);
// bitfield macros
#define _T3GCON_GGO_NOT_DONE_POSN                           0x3
#define _T3GCON_GGO_NOT_DONE_POSITION                       0x3
#define _T3GCON_GGO_NOT_DONE_SIZE                           0x1
#define _T3GCON_GGO_NOT_DONE_LENGTH                         0x1
#define _T3GCON_GGO_NOT_DONE_MASK                           0x8
#define _T3GCON_GVAL_POSN                                   0x2
#define _T3GCON_GVAL_POSITION                               0x2
#define _T3GCON_GVAL_SIZE                                   0x1
#define _T3GCON_GVAL_LENGTH                                 0x1
#define _T3GCON_GVAL_MASK                                   0x4
#define _T3GCON_GGO_nDONE_POSN                              0x3
#define _T3GCON_GGO_nDONE_POSITION                          0x3
#define _T3GCON_GGO_nDONE_SIZE                              0x1
#define _T3GCON_GGO_nDONE_LENGTH                            0x1
#define _T3GCON_GGO_nDONE_MASK                              0x8
#define _T3GCON_GSPM_POSN                                   0x4
#define _T3GCON_GSPM_POSITION                               0x4
#define _T3GCON_GSPM_SIZE                                   0x1
#define _T3GCON_GSPM_LENGTH                                 0x1
#define _T3GCON_GSPM_MASK                                   0x10
#define _T3GCON_GTM_POSN                                    0x5
#define _T3GCON_GTM_POSITION                                0x5
#define _T3GCON_GTM_SIZE                                    0x1
#define _T3GCON_GTM_LENGTH                                  0x1
#define _T3GCON_GTM_MASK                                    0x20
#define _T3GCON_GPOL_POSN                                   0x6
#define _T3GCON_GPOL_POSITION                               0x6
#define _T3GCON_GPOL_SIZE                                   0x1
#define _T3GCON_GPOL_LENGTH                                 0x1
#define _T3GCON_GPOL_MASK                                   0x40
#define _T3GCON_GE_POSN                                     0x7
#define _T3GCON_GE_POSITION                                 0x7
#define _T3GCON_GE_SIZE                                     0x1
#define _T3GCON_GE_LENGTH                                   0x1
#define _T3GCON_GE_MASK                                     0x80
#define _T3GCON_T3GGO_NOT_DONE_POSN                         0x3
#define _T3GCON_T3GGO_NOT_DONE_POSITION                     0x3
#define _T3GCON_T3GGO_NOT_DONE_SIZE                         0x1
#define _T3GCON_T3GGO_NOT_DONE_LENGTH                       0x1
#define _T3GCON_T3GGO_NOT_DONE_MASK                         0x8
#define _T3GCON_T3GVAL_POSN                                 0x2
#define _T3GCON_T3GVAL_POSITION                             0x2
#define _T3GCON_T3GVAL_SIZE                                 0x1
#define _T3GCON_T3GVAL_LENGTH                               0x1
#define _T3GCON_T3GVAL_MASK                                 0x4
#define _T3GCON_T3GGO_nDONE_POSN                            0x3
#define _T3GCON_T3GGO_nDONE_POSITION                        0x3
#define _T3GCON_T3GGO_nDONE_SIZE                            0x1
#define _T3GCON_T3GGO_nDONE_LENGTH                          0x1
#define _T3GCON_T3GGO_nDONE_MASK                            0x8
#define _T3GCON_T3GSPM_POSN                                 0x4
#define _T3GCON_T3GSPM_POSITION                             0x4
#define _T3GCON_T3GSPM_SIZE                                 0x1
#define _T3GCON_T3GSPM_LENGTH                               0x1
#define _T3GCON_T3GSPM_MASK                                 0x10
#define _T3GCON_T3GTM_POSN                                  0x5
#define _T3GCON_T3GTM_POSITION                              0x5
#define _T3GCON_T3GTM_SIZE                                  0x1
#define _T3GCON_T3GTM_LENGTH                                0x1
#define _T3GCON_T3GTM_MASK                                  0x20
#define _T3GCON_T3GPOL_POSN                                 0x6
#define _T3GCON_T3GPOL_POSITION                             0x6
#define _T3GCON_T3GPOL_SIZE                                 0x1
#define _T3GCON_T3GPOL_LENGTH                               0x1
#define _T3GCON_T3GPOL_MASK                                 0x40
#define _T3GCON_T3GE_POSN                                   0x7
#define _T3GCON_T3GE_POSITION                               0x7
#define _T3GCON_T3GE_SIZE                                   0x1
#define _T3GCON_T3GE_LENGTH                                 0x1
#define _T3GCON_T3GE_MASK                                   0x80
#define _T3GCON_T3GGO_POSN                                  0x3
#define _T3GCON_T3GGO_POSITION                              0x3
#define _T3GCON_T3GGO_SIZE                                  0x1
#define _T3GCON_T3GGO_LENGTH                                0x1
#define _T3GCON_T3GGO_MASK                                  0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO_nDONE            :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned T3GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO                  :1;
    };
} PR3bits_t;
extern volatile PR3bits_t PR3bits __at(0xFCA);
// bitfield macros
#define _PR3_GGO_NOT_DONE_POSN                              0x3
#define _PR3_GGO_NOT_DONE_POSITION                          0x3
#define _PR3_GGO_NOT_DONE_SIZE                              0x1
#define _PR3_GGO_NOT_DONE_LENGTH                            0x1
#define _PR3_GGO_NOT_DONE_MASK                              0x8
#define _PR3_GVAL_POSN                                      0x2
#define _PR3_GVAL_POSITION                                  0x2
#define _PR3_GVAL_SIZE                                      0x1
#define _PR3_GVAL_LENGTH                                    0x1
#define _PR3_GVAL_MASK                                      0x4
#define _PR3_GGO_nDONE_POSN                                 0x3
#define _PR3_GGO_nDONE_POSITION                             0x3
#define _PR3_GGO_nDONE_SIZE                                 0x1
#define _PR3_GGO_nDONE_LENGTH                               0x1
#define _PR3_GGO_nDONE_MASK                                 0x8
#define _PR3_GSPM_POSN                                      0x4
#define _PR3_GSPM_POSITION                                  0x4
#define _PR3_GSPM_SIZE                                      0x1
#define _PR3_GSPM_LENGTH                                    0x1
#define _PR3_GSPM_MASK                                      0x10
#define _PR3_GTM_POSN                                       0x5
#define _PR3_GTM_POSITION                                   0x5
#define _PR3_GTM_SIZE                                       0x1
#define _PR3_GTM_LENGTH                                     0x1
#define _PR3_GTM_MASK                                       0x20
#define _PR3_GPOL_POSN                                      0x6
#define _PR3_GPOL_POSITION                                  0x6
#define _PR3_GPOL_SIZE                                      0x1
#define _PR3_GPOL_LENGTH                                    0x1
#define _PR3_GPOL_MASK                                      0x40
#define _PR3_GE_POSN                                        0x7
#define _PR3_GE_POSITION                                    0x7
#define _PR3_GE_SIZE                                        0x1
#define _PR3_GE_LENGTH                                      0x1
#define _PR3_GE_MASK                                        0x80
#define _PR3_T3GGO_NOT_DONE_POSN                            0x3
#define _PR3_T3GGO_NOT_DONE_POSITION                        0x3
#define _PR3_T3GGO_NOT_DONE_SIZE                            0x1
#define _PR3_T3GGO_NOT_DONE_LENGTH                          0x1
#define _PR3_T3GGO_NOT_DONE_MASK                            0x8
#define _PR3_T3GVAL_POSN                                    0x2
#define _PR3_T3GVAL_POSITION                                0x2
#define _PR3_T3GVAL_SIZE                                    0x1
#define _PR3_T3GVAL_LENGTH                                  0x1
#define _PR3_T3GVAL_MASK                                    0x4
#define _PR3_T3GGO_nDONE_POSN                               0x3
#define _PR3_T3GGO_nDONE_POSITION                           0x3
#define _PR3_T3GGO_nDONE_SIZE                               0x1
#define _PR3_T3GGO_nDONE_LENGTH                             0x1
#define _PR3_T3GGO_nDONE_MASK                               0x8
#define _PR3_T3GSPM_POSN                                    0x4
#define _PR3_T3GSPM_POSITION                                0x4
#define _PR3_T3GSPM_SIZE                                    0x1
#define _PR3_T3GSPM_LENGTH                                  0x1
#define _PR3_T3GSPM_MASK                                    0x10
#define _PR3_T3GTM_POSN                                     0x5
#define _PR3_T3GTM_POSITION                                 0x5
#define _PR3_T3GTM_SIZE                                     0x1
#define _PR3_T3GTM_LENGTH                                   0x1
#define _PR3_T3GTM_MASK                                     0x20
#define _PR3_T3GPOL_POSN                                    0x6
#define _PR3_T3GPOL_POSITION                                0x6
#define _PR3_T3GPOL_SIZE                                    0x1
#define _PR3_T3GPOL_LENGTH                                  0x1
#define _PR3_T3GPOL_MASK                                    0x40
#define _PR3_T3GE_POSN                                      0x7
#define _PR3_T3GE_POSITION                                  0x7
#define _PR3_T3GE_SIZE                                      0x1
#define _PR3_T3GE_LENGTH                                    0x1
#define _PR3_T3GE_MASK                                      0x80
#define _PR3_T3GGO_POSN                                     0x3
#define _PR3_T3GGO_POSITION                                 0x3
#define _PR3_T3GGO_SIZE                                     0x1
#define _PR3_T3GGO_LENGTH                                   0x1
#define _PR3_T3GGO_MASK                                     0x8

// Register: T3GATE
#define T3GATE T3GATE
extern volatile unsigned char           T3GATE              __at(0xFCB);
#ifndef _LIB_BUILD
asm("T3GATE equ 0FCBh");
#endif
// aliases
extern volatile unsigned char           TMR3GATE            __at(0xFCB);
#ifndef _LIB_BUILD
asm("TMR3GATE equ 0FCBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned T3GSS2                 :1;
        unsigned T3GSS3                 :1;
    };
} T3GATEbits_t;
